Revit 2026 API

# FamilyItemFactoryNewReferencePoint(XYZ) Method

---

Create a reference point at a given location in an Autodesk Revit family document.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ReferencePoint NewReferencePoint(
	XYZ A_0
)
```
```vb
Public Function NewReferencePoint (
	A_0 As XYZ
) As ReferencePoint
```
```cpp
public:
ReferencePoint^ NewReferencePoint(
	XYZ^ A_0
)
```
```fsharp
member NewReferencePoint :
        A_0 : XYZ -> ReferencePoint
```

#### Parameters

A_0 XYZ

#### Return Value

ReferencePointThe newly created ReferencePoint.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the argument is . |
| InvalidOperationException | Thrown when the family is not a Conceptual Mass Family. |

The ReferencePoint will have a default coordinate system corresponding to the global coordinate system.

#### Reference

FamilyItemFactory Class

NewReferencePoint Overload

Autodesk.Revit.Creation Namespace